# Finish Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContext..::..Finish Method
IExportContext Interface See Also
---
This method is called at the very end of the export process, after all entities were processed (or after the process was cancelled).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
void Finish()
```

Visual Basic
---
```text
Sub Finish
```

Visual C++
---
```text
void Finish()
```

# See Also
IExportContext Interface
Autodesk.Revit.DB Namespace